{
  "backend/main.mo": "Defines product, category, user, and order types with admin login/session handling and provides queries and mutations for browsing products and managing user profiles.",
  "feature_evidence.json": "Lists feature evidence entries mapping product requirements to affected frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for all major frontend files, describing layout, hooks, components, pages, and cart logic.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH design tokens for light/dark themes and global background/foreground settings.",
  "frontend/index.html": "Root HTML template mounting the frontend app and loading the Vite entry script.",
  "frontend/src/App.tsx": "Main React app configuring all public and admin routes with TanStack Router plus theme provider and toaster.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Admin gate component that checks admin session status and shows loading or access-denied states before rendering children.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog form for creating or editing products, handling all product fields, category selection, photo upload, and saving via hooks.",
  "frontend/src/components/admin/ProductPhotoUploader.tsx": "Image uploader component handling validation, preview, upload progress, and removal using ExternalBlob.",
  "frontend/src/components/auth/CustomerLoginButton.tsx": "Login/logout button for customers using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting users to submit name and email to create their profile via a mutation.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin layout with navigation, header, footer, session check, and logout logic, wrapping protected admin routes.",
  "frontend/src/components/layout/SiteLayout.tsx": "Public site layout with navigation, cart badge, mobile menu, and customer login, excluding admin routes.",
  "frontend/src/components/products/AZFilter.tsx": "Alphabet filter allowing selection or clearing of a starting letter for product filtering.",
  "frontend/src/components/products/ProductCard.tsx": "Product display card with image, details, quantity selector, and add-to-cart functionality.",
  "frontend/src/components/products/QuantitySelector.tsx": "Numeric quantity control with increment/decrement buttons and clamped manual input handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAuthGate.ts": "Provides an auth gate hook that triggers login when needed and runs a queued action after successful authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, categories, orders, and user profiles through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom theme variables for light/dark medical-themed UI design.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About page describing the company, mission, vision, and values.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Lists all categories and provides a dialog to add new ones using query hooks.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin stats for products, categories, and pending orders with navigation links.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin authentication with session check, login form, and error feedback.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Shows order details, customer info, and allows updating the order status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders with basic info and links to view detailed order pages.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Manages products with listing, add/edit dialog, and delete confirmation.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page with item management, totals, and checkout navigation requiring authentication.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow, order submission, profile checks, and displays success or empty-cart states.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with basic validation and static business/contact info.",
  "frontend/src/pages/HomePage.tsx": "Displays hero section and hot products, supports add-to-cart with auth and profile checks.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows authenticated users their past orders and redirects unauthenticated users.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and shows detailed product info with image, pricing, and add-to-cart functionality.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with A–Z filtering and add-to-cart logic including auth/profile validation.",
  "frontend/src/state/cartStore.ts": "Zustand store for cart items with persistence and methods to modify cart state.",
  "frontend/src/utils/adminSession.ts": "Manages admin UI session state in localStorage by storing, retrieving, and clearing a timestamp value.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, container settings, and loading several plugins.",
  "project_state.json": "JSON file describing project requirements, architecture notes, known issues, and existing feature definitions."
}