{
  "backend/main.mo": "Main canister logic defining product, category, user profile, and order types, with admin authentication, user profile APIs, and hot‑product management using access control and storage mixins.",
  "backend/migration.mo": "Migration module converting old actor state to the new data model, adding fields such as netRate, mrp, isHot, and extended user profile fields while preserving existing data.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files, describing their roles in routing, UI components, hooks, and application features.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color variables for light and dark themes with shared base styles.",
  "frontend/index.html": "Basic HTML entry file mounting the root React application and loading the main module.",
  "frontend/src/App.tsx": "Application root defining TanStack Router routes for public and admin sections with theme provider and toaster notifications.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Admin-only route guard that checks admin session status and shows loading or access denied screens before rendering protected content.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "A dialog form for creating or editing a product, handling product fields, image upload, validation, and submission via updateProduct.",
  "frontend/src/components/admin/ProductPhotoUploader.tsx": "Handles image file selection, validation, previewing, upload progress, and removal for product photos.",
  "frontend/src/components/auth/CustomerLoginButton.tsx": "Displays a login/logout button tied to Internet Identity, managing authentication state and UI transitions.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to enter profile details and saving them via a profile mutation.",
  "frontend/src/components/layout/AdminLayout.tsx": "Provides the admin panel layout with navigation, session checks, logout handling, and guarded routing.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the public site layout with navigation, cart button, login button, and mobile menu, excluding admin routes.",
  "frontend/src/components/products/AZFilter.tsx": "Renders an A–Z filter UI with selectable alphabet buttons and a clear option.",
  "frontend/src/components/products/ProductCard.tsx": "Displays product details with image, pricing, category, quantity selection, and an add‑to‑cart button.",
  "frontend/src/components/products/QuantitySelector.tsx": "Provides increment/decrement controls and manual input for selecting a clamped quantity value.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAuthGate.ts": "Manages gated actions requiring authentication and triggers pending actions after successful login.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, categories, user profiles, and orders via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables for light/dark modes with a medical‑styled color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About Us page describing the company, mission, vision, and commitments.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Shows all categories and provides a dialog form for admins to create new categories.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin stats for products, categories, and pending orders with links to management pages.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Provides an admin login form with session checking, credential normalization, and error handling.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Shows detailed order info, customer details, and allows admins to update order status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders with customer info, status badges, and links to detailed order views.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin UI page listing all products with add, edit, and delete actions using dialogs and product queries.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item quantity controls, subtotal calculations, and checkout navigation depending on authentication.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles order submission, profile checks, cart validation, and shows success or empty-cart states.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with simulated submission and displays business contact details and hours.",
  "frontend/src/pages/HomePage.tsx": "Displays hero content, loads hot products, and supports authenticated add‑to‑cart with profile checks.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows the user's past orders with authentication gating and loading/empty states.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays detailed product information with image, pricing, and add‑to‑cart functionality.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a product catalog with A–Z filtering, profile checks, and add‑to‑cart handling with authentication gating.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items with persisted state and helpers for adding, removing, and updating quantities.",
  "frontend/src/utils/adminSession.ts": "Utility for storing, retrieving, and clearing admin UI session timestamps in localStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with extended theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing schema version, existing features, and pending feature requests for profile, hot products, and pricing updates."
}