{
  "backend/main.mo": "Defines categories, products, orders, user profiles, and admin auth with session handling plus storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across hooks, pages, components, and layouts.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML shell mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up full route tree with public and admin pages, shared layouts, and theme and router providers.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Checks admin session status and blocks access with a login prompt if unauthorized.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog for creating and editing products, including fields, validation, and photo upload handling.",
  "frontend/src/components/admin/ProductPhotoUploader.tsx": "Image uploader for products with validation, preview, and upload progress using ExternalBlob.",
  "frontend/src/components/auth/CustomerLoginButton.tsx": "Button handling customer login/logout via Internet Identity with loading states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for new users to submit name and email and save their profile.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin panel layout with navigation, session checks, and logout handling, wrapping admin routes.",
  "frontend/src/components/layout/SiteLayout.tsx": "Public site layout with header, navigation, cart indicator, login button, and mobile menu.",
  "frontend/src/components/products/AZFilter.tsx": "Alphabetical filter component allowing selection or clearing of a starting letter.",
  "frontend/src/components/products/ProductCard.tsx": "Product card showing image, details, price, category, and add‑to‑cart button.",
  "frontend/src/hooks/useActor.ts": "Hook creating an authenticated or anonymous backend actor and refreshing dependent queries on change.",
  "frontend/src/hooks/useAuthGate.ts": "Hook ensuring customer authentication before actions, queueing an action until login succeeds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking. Includes helper logic for creating AuthClient instances with default config.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as products, categories, user profiles, and orders. Uses the actor instance to call canister methods and manages cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark medical-themed UI, along with utility gradients and global styling. Applies consistent color tokens for components and layout.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering the main App component. Imports global CSS styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static About Us page describing the company's overview, mission, commitment, and reasons to partner. Uses styled sections and headings for layout and readability.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin interface to view and add product categories with dialogs, form validation, and list rendering.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin dashboard stats for products, categories, and pending orders using fetched data and navigable cards.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Provides admin login form with session check, authentication handling, and error feedback.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Shows detailed view of a specific order with customer info and allows updating order status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders with basic customer info, item counts, and links to detailed order views.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Manages product catalog with listing, creation, editing, and deletion features.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's shopping cart with item quantity controls, subtotal calculations, and navigation to checkout. Redirects unauthenticated users to products and handles empty-cart scenarios.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including user profile validation, order submission, and success confirmation. Requires authentication, processes cart items into order items, and manages post-submission UI.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with company contact info, business hours, and a simulated inquiry submission that triggers a toast message.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring hero content, product and contact CTAs, and a section highlighting key business features.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a user's past orders with authentication gating, loading states, and redirects if unauthenticated.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info, image, price, offers, and supports authenticated add‑to‑cart actions.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing with A–Z filtering, authentication checks, cart integration, and profile setup handling.",
  "frontend/src/state/cartStore.ts": "Implements a persisted Zustand store for cart items with add, remove, update, and total-item helpers.",
  "frontend/src/utils/adminSession.ts": "Manages admin session UI state in localStorage, including save, load, and clear operations.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them, supporting token/state handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins such as typography and container queries.",
  "project_state.json": "JSON describing the project’s current architecture, features, requirements, issues, and versioned state metadata."
}