{
  "backend/main.mo": "Motoko canister implementing categories, products, orders, and user profiles with access control, public browsing, and restricted user/admin actions.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend files used in the project.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH color variables and global layout rules.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up all public and admin routes with TanStack Router and wraps the app in theme and toast providers.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component that checks Internet Identity login and admin role, blocking access to admin pages if unauthorized.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog form for creating or editing a product, handling fields, photo upload, and submit via updateProduct mutation.",
  "frontend/src/components/admin/ProductPhotoUploader.tsx": "Handles image selection, validation, preview, upload progress, and emits an ExternalBlob for product photos.",
  "frontend/src/components/auth/CustomerLoginButton.tsx": "Login/logout button using Internet Identity with loading state and automatic session clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new users to submit name and email, saving via profile mutation.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin-only page layout with navigation, logout handling, and route guarding.",
  "frontend/src/components/layout/SiteLayout.tsx": "Public site layout with header, navigation, cart button, login button, and mobile menu.",
  "frontend/src/components/products/AZFilter.tsx": "Alphabet filter component allowing users to pick or clear a starting-letter filter.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product with image, details, price, category, and add-to-cart button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuthGate.ts": "Provides a helper to require authentication for actions, triggering login and executing the intended action afterward.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, stored identity restoration, and status tracking via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching and mutation hooks for products, categories, orders, and user profiles using the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom color variables for light and dark medical-themed UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "A static About page describing the company, mission, vision, and values.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Displays all categories, allows adding new ones via a dialog, and shows loading or empty states.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin stats for products, categories, and pending orders with navigation links.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin login using Internet Identity and redirects authenticated admins to the dashboard.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Displays details for a single order and lets admins update its status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders with status badges and links to detailed views, showing loading and empty states.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Shows product list with edit and delete actions and opens dialogs for adding or editing products.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item management, totals, and checkout navigation based on authentication.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow, requiring authentication and profile completion before submitting orders and clearing the cart.",
  "frontend/src/pages/ContactPage.tsx": "Displays company contact info and a simple contact form with simulated submission.",
  "frontend/src/pages/HomePage.tsx": "Provides the landing page with hero content, features, and calls to action for browsing products or contacting.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows authenticated users their past orders, with loading and empty states.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays detailed product info and allows users to add the item to their cart with auth gating.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with A–Z filtering and handles adding items to the cart after auth and profile checks.",
  "frontend/src/state/cartStore.ts": "Defines a persisted Zustand store for cart items with add, remove, update, and total-count helpers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from session or the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and enabling typography, container-query, and animate plugins.",
  "project_state.json": "JSON file storing project metadata, feature definitions, requirements, and architectural notes for the application."
}