{
  "kind": "build_request",
  "title": "Show customer/orderer details for each order in the admin panel",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add an admin-session-protected backend query that returns the customer (orderer) details for a given order, including the customer Principal and the saved UserProfile (name, email) if available.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "1.please add function of showing custmber/orderer detail in admin panel"
        ]
      },
      "acceptanceCriteria": [
        "When called by an authenticated admin session, the new query returns customer/orderer details for the specified order ID.",
        "If the order ID does not exist, the backend returns a clear error (trap) consistent with existing patterns (e.g., \"Order does not exist\").",
        "If the customer has not saved a user profile yet, the query still returns the customer Principal and indicates that the profile is missing (e.g., null/empty optional).",
        "When called without an active admin session, the query is rejected with \"Unauthorized: Admin session required\" (or equivalent existing message)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the admin orders data flow so the frontend can display customer/orderer details (name, email, and principal) in the admin panel orders list and order detail views using backend data (not hardcoded).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "1.please add function of showing custmber/orderer detail in admin panel"
        ]
      },
      "acceptanceCriteria": [
        "The frontend has a React Query hook to fetch the customer/orderer details needed by the admin UI (either per-order or as part of an enriched admin orders query).",
        "The implementation does not rely on AccessControl.isAdmin checks for admin panel access; it uses the existing admin session authorization model (requireAdminSession).",
        "No changes are made to the customer login flow (Internet Identity) or to public browsing behavior."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Enhance the admin UI to show customer/orderer details for each order: (1) in the Admin Orders list, show customer name/email when available (fallback to showing the principal), and (2) in the Admin Order Detail page, show a dedicated \"Customer Details\" section with name, email, and principal (with clear \"Not provided\" fallbacks).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "1.please add function of showing custmber/orderer detail in admin panel"
        ]
      },
      "acceptanceCriteria": [
        "AdminOrdersPage shows customer/orderer info beyond the truncated principal (at minimum name and/or email when available; otherwise shows principal).",
        "AdminOrderDetailPage includes a \"Customer Details\" section that displays: Name, Email, and Customer Principal.",
        "If profile data is not available for an order, the UI displays \"Not provided\" (in English) for missing fields without crashing.",
        "All customer/orderer details are only visible behind existing admin route protection (AdminRouteGuard / admin session)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit any frontend files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not modify immutable frontend hook files listed in SYSTEM_CONTEXT (compose new hooks/utilities or update non-immutable files instead)."
  ],
  "nonGoals": [
    "Adding new customer profile fields beyond the existing name and email (e.g., address, phone) unless explicitly requested.",
    "Adding email/SMS notifications for new orders.",
    "Changing the order submission workflow, order ID generation, or existing status options beyond what is required to display customer details."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}