{
  "kind": "build_request",
  "title": "Extend customer profile fields, add admin-managed Hot Products, and update pricing to Net Rate & MRP",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the customer profile data model to store phone number, PAN number, and address, and update all related read/write backend APIs and frontend profile setup flow to support these fields.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can make some other function like  in login( customer ) also keep option of phone number , pan no. , and adress also"
        ]
      },
      "acceptanceCriteria": [
        "Backend `UserProfile` includes fields for phone number, PAN number, and address (in addition to existing name/email).",
        "Existing customers who already created a profile can still load their profile without errors after the update (missing fields handled safely).",
        "`ProfileSetupDialog` prompts for Full Name, Email Address, Phone Number, PAN Number, and Address (English labels), and saves them via the existing save profile mutation.",
        "Checkout page “Customer Information” displays the new fields when present (and does not break if they are empty).",
        "Admin order-customer details view (used in admin order detail) includes the new profile fields when present."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a dedicated admin-managed 'Hot Products' mechanism so admins can mark/unmark products as hot, and update the Home page Hot Products section to display only the admin-marked hot products (instead of selecting the first 4 products).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "and aslo keep sepeate compatment for keeeping hot product"
        ]
      },
      "acceptanceCriteria": [
        "Backend product model supports a persisted hot/featured flag for each product.",
        "Admin product editor UI includes a clear control (e.g., checkbox/switch) to set whether a product is a Hot Product.",
        "Home page Hot Products section renders products that are marked hot; it no longer uses `products.slice(0, 4)` selection logic.",
        "If no products are marked hot, the Home page Hot Products section shows an appropriate empty state message (in English) and does not crash."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the existing 'Wholesale' pricing with 'Net Rate' and add a separate 'MRP' price field; update backend product data, admin product editor inputs, and all customer-facing displays and cart/order calculations to use Net Rate as the transactional price while also displaying MRP where appropriate.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "also change in  wholesle into net rate and mrp"
        ]
      },
      "acceptanceCriteria": [
        "Backend product model supports two numeric prices: Net Rate and MRP.",
        "Admin product editor shows two numeric inputs labeled 'Net Rate (NPR)' and 'MRP (NPR)' (replacing 'Wholesale Price (NPR)').",
        "ProductCard replaces the 'wholesale' label with 'Net Rate' and shows MRP as a secondary value (formatting is consistent and readable).",
        "Product detail page replaces 'Wholesale Price' with 'Net Rate' and also shows MRP.",
        "Cart and checkout totals continue to compute using the Net Rate price (not MRP).",
        "Any remaining user-facing text that says 'Wholesale' in the pricing context is updated to 'Net Rate' (English)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If the canister currently preserves state across upgrades, add/adjust conditional migration so existing stored products and user profiles are upgraded to the new schema (defaulting new fields safely) without losing data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pan no. , and adress also  and aslo keep sepeate compatment for keeeping hot product, also change in  wholesle into net rate and mrp"
        ]
      },
      "acceptanceCriteria": [
        "Migration (only if applicable per project migration policy) converts existing `UserProfile` records to include the new fields with safe defaults.",
        "Migration (only if applicable) converts existing products so Net Rate is initialized from the previous single price field and MRP is initialized to a safe default (and hot flag defaults to false).",
        "After upgrade, existing products and profiles can still be fetched via existing queries without runtime traps."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui` or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Add third-party authentication providers (only Internet Identity is supported).",
    "Add real-time/websocket features.",
    "Add external database integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}