{
  "kind": "build_request",
  "title": "Add product quantity selector and replace Home \"Why Choose Us\" with \"Hot Products\" list",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Add a quantity selector option on product surfaces so customers can choose a quantity before adding a product to the cart, including on the Products listing cards and the Product Detail page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "2. aslo add quantity option in product"
        ]
      },
      "acceptanceCriteria": [
        "On ProductsPage, each ProductCard provides a quantity control (e.g., stepper or numeric input) with a default quantity of 1.",
        "On ProductDetailPage, the page provides a quantity control with a default quantity of 1.",
        "Clicking “Add to Cart” uses the selected quantity (not always +1).",
        "Quantity is validated client-side to be an integer >= 1; invalid values are prevented or corrected to 1.",
        "The existing cart page quantity controls continue to work as-is for adjusting quantities after items are in the cart."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update the cart state API to support adding items with an explicit quantity, and ensure existing add-to-cart flows use the new quantity-aware behavior without breaking checkout/order submission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "2. aslo add quantity option in product"
        ]
      },
      "acceptanceCriteria": [
        "The cart store addItem action supports specifying a quantity when adding a product.",
        "If a product already exists in the cart, adding with quantity N increases its quantity by N (rather than always +1).",
        "Checkout submission still sends the final cart quantities to the backend unchanged (i.e., quantities reflect the selected quantity plus any later cart edits).",
        "No TypeScript errors remain in pages/components that call addItem (e.g., ProductsPage, ProductDetailPage)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Replace the Home page “Why Choose Us” section with a “Hot Products” section that displays a list of products fetched from the existing products query.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "3. also replace the part of why choosing us to hot product and keep list of product list there"
        ]
      },
      "acceptanceCriteria": [
        "HomePage no longer renders the “Why Choose Us” feature grid.",
        "HomePage renders a section titled “Hot Products”.",
        "The “Hot Products” section fetches products using the existing frontend data hooks and renders a product list/grid (reusing existing product UI where practical).",
        "Each listed product links to its Product Detail page and provides a clear path to view all products (e.g., a “View All Products” link/button).",
        "If products are still loading or empty, the section shows an appropriate loading/empty state message in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose these components instead).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if a stable state upgrade is required (not expected for these UI/cart changes)."
  ],
  "nonGoals": [
    "Do not change the backend Product, Order, or OrderItem schema.",
    "Do not implement a new admin feature for marking products as “hot” (the Home “Hot Products” list can be derived from existing product data, e.g., showing a subset).",
    "Do not add third-party services, analytics, or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}