{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin orders: display customer/orderer details (name, email, principal)",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Add React Query data flow for admin to fetch per-order customer/orderer details from the backend and consume it in admin views using the existing admin session authorization model.",
      "acceptanceCriteria": [
        "The frontend has a React Query hook to fetch the customer/orderer details needed by the admin UI (either per-order or as part of an enriched admin orders query).",
        "The implementation does not rely on AccessControl.isAdmin checks for admin panel access; it uses the existing admin session authorization model (requireAdminSession).",
        "No changes are made to the customer login flow (Internet Identity) or to public browsing behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook (e.g., useGetOrderCustomerDetails(orderId)) that calls the backend capability getOrderCustomerDetails and returns customer principal plus optional UserProfile (name/email). Ensure the query is actor-dependent, disabled when actor/orderId are missing, and uses retry=false to surface admin-session authorization failures cleanly. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Enhance admin orders list and order detail UI to show customer/orderer name/email (when available) with principal fallback and a dedicated Customer Details section in the order detail page.",
      "acceptanceCriteria": [
        "AdminOrdersPage shows customer/orderer info beyond the truncated principal (at minimum name and/or email when available; otherwise shows principal).",
        "AdminOrderDetailPage includes a \"Customer Details\" section that displays: Name, Email, and Customer Principal.",
        "If profile data is not available for an order, the UI displays \"Not provided\" (in English) for missing fields without crashing.",
        "All customer/orderer details are only visible behind existing admin route protection (AdminRouteGuard / admin session)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminOrdersPage.tsx",
          "operation": "modify",
          "description": "Update the orders list to render customer/orderer details fetched via the new hook. Because hooks cannot be called inside a map, introduce a small per-row child component (defined in-file or imported) that accepts orderId and falls back to showing the order's customer principal while loading/error. Display name and/or email when available; otherwise show the principal (truncated). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrderDetailPage.tsx",
          "operation": "modify",
          "description": "Add a \"Customer Details\" section that uses the new hook to fetch and display Name, Email, and Customer Principal for the selected order. Use clear \"Not provided\" fallbacks when profile or fields are missing, and keep the existing principal display consistent with backend-returned principal. Ensure errors (including unauthorized) do not crash the page. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}